---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallSweepOrientation
source: html/5d6162af-4a9a-41f0-696d-cc8e9a5ec273.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallSweepOrientation Property

"Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId WallSweepOrientation { get; }
```